src/Documents/КАЗ_УстановкаЛимитов/КАЗ_УстановкаЛимитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАЗ_УстановкаЛимитов</name>
  <registerRecords>AccumulationRegister.КАЗ_ЛимитыПлатежей</registerRecords>
  <attributes>
    <name>ПериодЛимита</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Лимиты</name>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.КАЗ_ЦентрыФинансовойОтветственности</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяПлатежа</name>
      <type>
        <types>CatalogRef.КАЗ_СтатьиПлатежей</types>
      </type>
    </attributes>
    <attributes>
      <name>Лимит</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/КАЗ_ЛимитыПлатежей/КАЗ_ЛимитыПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КАЗ_ЛимитыПлатежей</name>
  <resources>
    <name>Лимит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.КАЗ_ЦентрыФинансовойОтветственности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяПлатежа</name>
    <type>
      <types>CatalogRef.КАЗ_СтатьиПлатежей</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/КАЗ_УстановкаЛимитов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Лимиты.Количество() = 0 Тогда
		Сообщить("Не заполнена табличная часть лимитов.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.КАЗ_ЛимитыПлатежей.Записывать = Истина;

	Для Каждого СтрокаЛимита Из Лимиты Цикл

		Если Не ЗначениеЗаполнено(СтрокаЛимита.ЦФО) Тогда
			Сообщить("В строке лимитов не заполнен центр финансовой ответственности.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаЛимита.СтатьяПлатежа) Тогда
			Сообщить("В строке лимитов не заполнена статья платежа.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Если СтрокаЛимита.Лимит <= 0 Тогда
			Сообщить("Лимит должен быть больше нуля.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Движение = Движения.КАЗ_ЛимитыПлатежей.Добавить();

		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ЦФО = СтрокаЛимита.ЦФО;
		Движение.СтатьяПлатежа = СтрокаЛимита.СтатьяПлатежа;
		Движение.Лимит = СтрокаЛимита.Лимит;

	КонецЦикла;

КонецПроцедуры
